<h3>1. 개인정보 처리 목적</h3>

<p>
    본 사이트는 "서비스 제공에 따른 본인 식별 및 인증, 회원자격 유지 및 관리
    등"의 목적을 위해 개인정보를 처리합니다.
</p>

<h3>2. 처리하는 개인정보의 항목</h3>

<ul>
    <li>
        <p>
            본 사이트는 다음 로그인 제공자에게 다음과 같은 개인정보를
            제공받습니다.
        </p>
        <ul>
            <li>
                로그인 제공자
                <ul>
                    <li>카카오</li>
                    <li>Github</li>
                </ul>
            </li>
            <li>
                제공받는 개인정보
                <ul>
                    <li>닉네임</li>
                    <li>프로필 이미지</li>
                </ul>
            </li>
        </ul>
    </li>
    <li>
        <p>
            본 사이트는 유저의 선택에 따라 다음과 같은 정보를 유저로부터
            제공받을 수 있습니다.
        </p>
        <ul>
            <li>
                동더히로바(https://donderhiroba.jp)에서 해당 사이트의 이용자가 열람 가능한 정보
                <ul>
                    <li>
                        플레이어 정보
                        <ul>
                            <li>닉네임</li>
                            <li>북번호(太鼓番)</li>
                            <li>마이동(캐릭터) 이미지</li>
                        </ul>
                    </li>
                    <li>곡 플레이 기록</li>
                </ul>
            </li>
        </ul>
    </li>
</ul>

<h3>3. 개인 정보의 처리, 보유 기간 및 파기</h3>

<ul>
    <li>
        본 사이트는 다음 개인정보를 유저 탈퇴 이전까지 처리 및 보유하며, 유저
        탈퇴 시 파기합니다.
        <ul>
            <li>
                로그인 제공자로부터 제공받는 개인정보
                <ul>
                    <li>닉네임</li>
                    <li>프로필 이미지</li>
                </ul>
            </li>
            <li>사이트 내 유저 설정에서 유저가 설정하는 닉네임</li>
            <li>유저가 제공한 동더히로바 관련 정보</li>
        </ul>
    </li>
    <li>
        본 사이트가 개인정보를 파기할 때에는 복구 및 재생하지 못하도록
        파기합니다.
    </li>
</ul>

<h3>4. 정보주체와 법정대리인의 권리 및 의무</h3>

정보주체 및 법정대리인은 본 사이트에 대해 언제든지 다음 각 호의 개인정보 보호
관련 권리를 행사할 수 있습니다.
<ol>
    <li>개인정보 열람요구</li>
    <li>오류 등이 있을 경우 정정 요구</li>
    <li>삭제요구</li>
    <li>처리정지 요구</li>
</ol>

<h3>5. 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항</h3>

<ul>
    <li>
        본 사이트는 '쿠키(cookie)'를 사용합니다. 쿠키는 유저의 브라우저에
        저장되며, 본 사이트에 요청을 보낼 시 함께 전송되는 소량의 정보입니다.
    </li>
    <li>
        본 사이트는 다음의 목적으로 쿠키를 사용합니다.
        <ul>
            <li>이용자의 식별</li>
            <li>이용자의 접속 빈도나 방문 시간 등을 분석</li>
        </ul>
    </li>
    <li>
        이용자가 브라우저 설정을 통해 쿠키의 사용 여부를 결정할 수 있습니다. 단,
        쿠키를 사용하지 않을 경우 서비스 제공에 어려움이 있을 수 있습니다.
    </li>
</ul>
